Revit 2024 API
BuiltInFailures.DocumentFailures.DUMisbehavingUpdater Property
 Third party updater '[Name]' has experienced a problem and its action had to be canceled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DUMisbehavingUpdater { get; }
Visual Basic
Public Shared ReadOnly Property DUMisbehavingUpdater As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DUMisbehavingUpdater {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DocumentFailures Class
Autodesk.Revit.DB Namespace